## [ Excel => DataFrame 저장다루기]

(1) 모듈 로딩 <hr>

In [2]:
import pandas as pd

(2) 데이터 준비 <hr>

In [3]:
file1 = '../DATA/Single Worksheet.xlsx'
file2 = '../DATA/Multiple Worksheets.xlsx'

(3) EXCEL => DataFrame 저장하기

In [5]:
pd.read_excel(file1)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [6]:
pd.read_excel(file1, header = None, usecols = [1, 3], index_col = 1)

                1
3
Gender  Last Name
M           James
M         Hawkins
F             Day
F            Ruiz
F           Gomez

In [12]:
pd.read_excel(file2, sheet_name = 0)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [13]:
pd.read_excel(file2, sheet_name = 'Data 1')

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F